src/InformationRegisters/ГринАПИ_ПараметрыПодключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГринАПИ_ПараметрыПодключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КлючОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КонтактИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПользовательWhatsApp</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГринАПИ_ПользователиWhatsApp</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГринАПИ_Контакты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ГринАПИ_Контакты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГринАПИ_Контакты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПользовательWhatsApp</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГринАПИ_ПользователиWhatsApp</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючОбсуждения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ГринАПИ_ПользователиWhatsApp.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ГринАПИ_ПользователиWhatsApp</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>idInstance</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ApiToken</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>90</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/ГринАПИ_ПараметрыПодключения/Ext/ManagerModule.bsl
Процедура УдалитьВсеЗаписи() Экспорт  		
	НаборЗаписей = РегистрыСведений.ГринАПИ_ПараметрыПодключения.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();	 
КонецПроцедуры     

Процедура ДобавитьЗаписьВРегистрСведений(Контакт, КлючОбсуждения = Неопределено, 
	КонтактИдентификатор = Неопределено) Экспорт
	    
    МенеджерЗаписи = РегистрыСведений.ГринАПИ_ПараметрыПодключения.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.Контакт              = Контакт;
	МенеджерЗаписи.ПользовательWhatsApp = Контакт.ПользовательWhatsApp;
	
	Если Не КлючОбсуждения = Неопределено Тогда
		МенеджерЗаписи.КлючОбсуждения = КлючОбсуждения;	
	КонецЕсли;
	
	Если Не КонтактИдентификатор = Неопределено Тогда
		МенеджерЗаписи.КонтактИдентификатор = КонтактИдентификатор;	
	КонецЕсли;	
	
	МенеджерЗаписи.Записать();    
	
КонецПроцедуры    

Функция ПолучитьДанныеКонтакта(КлючОбсуждения) Экспорт 	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГринАПИ_Контакты.Наименование КАК Контакт,
	|	ГринАПИ_Контакты.НомерТелефона КАК НомерТелефона,
	|	ГринАПИ_ПользователиWhatsApp.idInstance КАК idInstance,
	|	ГринАПИ_ПользователиWhatsApp.ApiToken КАК ApiToken,
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения КАК КлючОбсуждения
	|ИЗ
	|	РегистрСведений.ГринАПИ_ПараметрыПодключения КАК ГринАПИ_ПараметрыПодключения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_Контакты КАК ГринАПИ_Контакты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_ПользователиWhatsApp КАК ГринАПИ_ПользователиWhatsApp
	|			ПО ГринАПИ_Контакты.ПользовательWhatsApp = ГринАПИ_ПользователиWhatsApp.Ссылка
	|		ПО ГринАПИ_ПараметрыПодключения.Контакт = ГринАПИ_Контакты.Ссылка
	|ГДЕ
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения = &КлючОбсуждения";
	
	Запрос.УстановитьПараметр("КлючОбсуждения", КлючОбсуждения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	НомераТелефонов        = Новый Массив;
	РезультатСтруктура     = Новый Структура("Контакт, НомерТелефона, idInstance, ApiToken, КлючОбсуждения");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, ВыборкаДетальныеЗаписи);
		НомераТелефонов.Добавить(ВыборкаДетальныеЗаписи.НомерТелефона);
	КонецЦикла;    
	
	РезультатСтруктура.Вставить("НомераТелефонов", НомераТелефонов);
	
	Возврат РезультатСтруктура;
	
КонецФункции  

Функция ПолучитьДанныеКонтактаИзМассива(КлючОбсуждения) Экспорт 	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГринАПИ_Контакты.Наименование КАК Контакт,
	|	ГринАПИ_Контакты.НомерТелефона КАК НомерТелефона,
	|	ГринАПИ_ПользователиWhatsApp.idInstance КАК idInstance,
	|	ГринАПИ_ПользователиWhatsApp.ApiToken КАК ApiToken,
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения КАК КлючОбсуждения
	|ИЗ
	|	РегистрСведений.ГринАПИ_ПараметрыПодключения КАК ГринАПИ_ПараметрыПодключения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_Контакты КАК ГринАПИ_Контакты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_ПользователиWhatsApp КАК ГринАПИ_ПользователиWhatsApp
	|			ПО ГринАПИ_Контакты.ПользовательWhatsApp = ГринАПИ_ПользователиWhatsApp.Ссылка
	|		ПО ГринАПИ_ПараметрыПодключения.Контакт = ГринАПИ_Контакты.Ссылка
	|ГДЕ
	|	ГринАПИ_ПараметрыПодключения.КонтактИдентификатор В(&КлючОбсуждения)";
	
	Запрос.УстановитьПараметр("КлючОбсуждения", КлючОбсуждения);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;   
	
	НомераТелефонов        = Новый Массив;
	РезультатСтруктура     = Новый Структура("Контакт, НомерТелефона, idInstance, ApiToken, КлючОбсуждения");
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл		
		ЗаполнитьЗначенияСвойств(РезультатСтруктура, ВыборкаДетальныеЗаписи);		
		НомераТелефонов.Добавить(ВыборкаДетальныеЗаписи.НомерТелефона);
	КонецЦикла;
	
	РезультатСтруктура.Вставить("НомераТелефонов", НомераТелефонов);
	
	Возврат РезультатСтруктура;
	
КонецФункции  

Функция ПолучитьДанныеКонтактов() Экспорт 	
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ГринАПИ_Контакты.Наименование КАК Контакт,
	|	ГринАПИ_Контакты.НомерТелефона КАК НомерТелефона,
	|	ГринАПИ_ПользователиWhatsApp.idInstance КАК idInstance,
	|	ГринАПИ_ПользователиWhatsApp.ApiToken КАК ApiToken,
	|	ГринАПИ_ПараметрыПодключения.КлючОбсуждения КАК КлючОбсуждения
	|ИЗ
	|	РегистрСведений.ГринАПИ_ПараметрыПодключения КАК ГринАПИ_ПараметрыПодключения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_Контакты КАК ГринАПИ_Контакты
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГринАПИ_ПользователиWhatsApp КАК ГринАПИ_ПользователиWhatsApp
	|			ПО ГринАПИ_Контакты.ПользовательWhatsApp = ГринАПИ_ПользователиWhatsApp.Ссылка
	|		ПО ГринАПИ_ПараметрыПодключения.Контакт = ГринАПИ_Контакты.Ссылка";	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат Неопределено;
	КонецЕсли;
	
	Результат = РезультатЗапроса.Выгрузить();	
	
	Возврат Результат;	
	
КонецФункции
